import random

# порядок числа a по модулю m это степень l при которой a ^ l сравнимо с единицей (mod m)
def test_ferma(n):
    a = random.randint(2, n - 2)
    r = pow(a, n - 1, n)
    if(r == 1):
        print("Число n, вероятно, простое")
    else:
        print("Число n составное")

test_ferma(13945754999792127277)
test_ferma(1910392819281856753342362664981670449081)
test_ferma(230868847099016479369241273560654413619)
test_ferma(10559821643272010452261027279670030138425095408945904756634125771064441932046413)

def jacobi_symbol(a, n):
    # Свойство периодичности: (a / n) = (a % n / n)
    a %= n
    result = 1

    while a != 0:
        # Извлекаем все двойки из верхнего аргумента (свойство мультипликативности)
        while a % 2 == 0:
            a //= 2
            # Если n ≡ 3 или 5 (mod 8), то (2 / n) = -1
            if n % 8 in (3, 5):
                result = -result

        # Закон квадратичной взаимности: меняем местами числитель и знаменатель
        a, n = n, a

        # Если оба числа ≡ 3 (mod 4), знак меняется
        if a % 4 == 3 and n % 4 == 3:
            result = -result

        # Снова приводим по модулю
        a %= n

    # Если n стал равен 1, то НОД(исходных чисел) был 1, возвращаем результат.
    # Если n > 1, значит у чисел был общий делитель, символ Якоби равен 0.
    return result if n == 1 else 0

def test_soloveya(n):
    a = random.randint(2, n - 2)
    r = pow(a, (n - 1) // 2, n)

    if(r != 1 and r != n - 1):
        print("Число n составное")
        return

    s = jacobi_symbol(a, n)

    if(r != (s % n)):
        print("Число n составное")
        return

    print("Число n, вероятно, простое")

test_soloveya(13945754999792127277)
test_soloveya(1910392819281856753342362664981670449081)
test_soloveya(230868847099016479369241273560654413619)
test_soloveya(10559821643272010452261027279670030138425095408945904756634125771064441932046413)

def test_hitler(n):
    s = 0
    r = n - 1
    while r % 2 == 0:
        s += 1
        r //= 2

    a = random.randint(2, n - 2)
    y = pow(a, r, n)

    if(y != 1 and y != (n - 1)):
        j = 1
        if(j <= (s - 1) and y != (n - 1)):
            y = (y * y) % n

            if(y == 1):
                 print("Число n составное")
                 return
            j = j + 1
        if(y != (n - 1)):
            print("Число n составное")
            return

    print("Число n, вероятно, простое")

test_hitler(13945754999792127277)
test_hitler(1910392819281856753342362664981670449081)
test_hitler(230868847099016479369241273560654413619)
test_hitler(10559821643272010452261027279670030138425095408945904756634125771064441932046413)

